## 피봇테이블과 그룹분석

### 1) 피봇테이블

In [9]:
import pandas as pd
import numpy as np

In [6]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

df.pivot(행인덱스로 지정할 열,열인덱스로 지정할 열,데이터로 사용할 열)

In [7]:
# index , column, value(data)
df1.pivot('도시','연도','인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### 2. 그룹분석

- groupby : groupby 메서드는 데이터를 그룹 별로 분류하는 역할

groupby 메서드의 인수로는 다음과 같은 값을 사용한다.

df.groupby(  ).함수

In [10]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [11]:
#key1의 값(A 또는 B)에 따른 data의 합계는 어떻게 구할까?
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [12]:
df2.groupby(df2['key1']).sum()

      data1  data2
key1
A         8     80
B         7     70

In [13]:
df2.groupby(df2.key2)['data2'].mean()

key2
one    30
two    30
Name: data2, dtype: int64

In [14]:
df2.groupby('key2').data2.mean()

key2
one    30
two    30
Name: data2, dtype: int64

In [15]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [18]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
# 1등석에 탄 여성의 나이 평균
titanic.age.groupby([titanic.pclass, titanic.sex]).mean()
#  구할 것               조건1          조건2     연산함수

pclass  sex
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: age, dtype: float64

In [24]:
# 성별에 따른 나이평균
titanic['age'].groupby( titanic['sex'] ).mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [26]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [27]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

iris.groupby('species').agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [29]:
iris.groupby('species').agg( lambda x: x.max() - x.min() )

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               1.5          2.1           0.9          0.5
versicolor           2.1          1.4           2.1          0.8
virginica            3.0          1.6           2.4          1.1

### 3) pivot_table_method

: pivot 명령과 groupby 명령의 중간 성격을 가지는 pivot_table

pivot_table 명령은 groupby 명령처럼 그룹분석을 하지만

최종적으로는 pivot 명령처럼 피봇테이블을 만든다

In [36]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [41]:
df1.pivot('인구','도시','연도')

#행인덱스 지정할 열, 열인덱스 지정할 열, 데이터로 쓰일 열
#pivot 기본 - 합계

도시         부산    서울    인천
인구
263203    NaN   NaN  2010
2890451   NaN   NaN  2015
3393191  2010   NaN   NaN
3448737  2015   NaN   NaN
3512547  2005   NaN   NaN
9631482   NaN  2010   NaN
9762546   NaN  2005   NaN
9904312   NaN  2015   NaN

In [42]:
df1.pivot_table('인구','도시','연도', margins=True, margins_name='합계')

# margins=True 인수를 주면 aggfunc로 주어진 분석 방법을
# 해당 열의 모든 데이터, 해당 행의 모든 데이터 그리고 전체 데이터에 대해 적용한 결과를 같이 보여준다.
# aggfunc가 주어지지 않았으면 평균을 계산한다.

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

### pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, margins_name='All')

- tips 데이터 사례

In [44]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [50]:
tips['tip_pct'] = np.round( tips['tip'] / tips['total_bill'] * 100 , 2)
#np.round( ,2) : 소수점 둘째 자리 까지

In [51]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size  tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3    20.39
240       27.18  2.00  Female    Yes   Sat  Dinner     2     7.36
241       22.67  2.00    Male    Yes   Sat  Dinner     2     8.82
242       17.82  1.75    Male     No   Sat  Dinner     2     9.82
243       18.78  3.00  Female     No  Thur  Dinner     2    15.97

In [54]:
# 성별 데이터 갯수
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [58]:
tips.groupby( ['sex','smoker'] ).size()
#size 명령을 사용하면 더 간단히 표시된다. size 명령은 NaN이 있어도 상관하지 않는다.
#성별과 흡연유무로 나누어 "데이터의 갯수"를 알아본다.

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [65]:
# 성별 팁 비율
tips.groupby('sex')[ ['tip_pct'] ].mean()
#                   리스트를 써서 인덱싱하면 데이터프레임이 반환된다.

          tip_pct
sex
Male    15.764713
Female  16.648276

In [63]:
# 흡연유무에 따른 팁 비율
tips.groupby('smoker')[ ['tip_pct'] ].mean()

          tip_pct
smoker
Yes     16.319140
No      15.932318

In [64]:
# 성별/흡연유무에 따른 팁 비율
tips.groupby( ['sex','smoker'] )[['tip_pct']].mean()

                 tip_pct
sex    smoker
Male   Yes     15.276667
       No      16.066598
Female Yes     18.214545
       No      15.691111

In [66]:
tips.pivot_table('tip_pct','sex','smoker')
#        데이터, 행인덱스 지정 열, 열인덱스 지정 열

smoker        Yes         No
sex
Male    15.276667  16.066598
Female  18.214545  15.691111

In [69]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2     5.94
1       10.34  1.66    Male     No  Sun  Dinner     3    16.05
2       21.01  3.50    Male     No  Sun  Dinner     3    16.66
3       23.68  3.31    Male     No  Sun  Dinner     2    13.98
4       24.59  3.61  Female     No  Sun  Dinner     4    14.68

In [71]:
#팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

tips.groupby('day')[ ['tip_pct'] ].mean()

        tip_pct
day
Thur  16.126452
Fri   16.991579
Sat   15.314598
Sun   16.689605

In [72]:
tips.groupby('time')[ ['tip_pct'] ].mean()

          tip_pct
time
Lunch   16.411765
Dinner  15.951477

In [75]:
tips.groupby( ['day','time'] )[ ['tip_pct'] ].mean()

               tip_pct
day  time
Thur Lunch   16.129016
     Dinner  15.970000
Fri  Lunch   18.875714
     Dinner  15.892500
Sat  Lunch         NaN
     Dinner  15.314598
Sun  Lunch         NaN
     Dinner  16.689605

In [77]:
tips.pivot_table('tip_pct','time', 'day')

day          Thur        Fri        Sat        Sun
time
Lunch   16.129016  18.875714        NaN        NaN
Dinner  15.970000  15.892500  15.314598  16.689605

In [78]:
tips.pivot_table('tip_pct', ['time','size'] , 'day')

day               Thur        Fri        Sat        Sun
time   size
Lunch  1     18.170000  22.380000        NaN        NaN
       2     16.401277  18.196000        NaN        NaN
       3     14.460000  18.770000        NaN        NaN
       4     14.552000        NaN        NaN        NaN
       5     12.140000        NaN        NaN        NaN
       6     17.366667        NaN        NaN        NaN
Dinner 1           NaN        NaN  23.180000        NaN
       2     15.970000  16.267273  15.528679  18.086410
       3           NaN        NaN  15.142222  15.266000
       4           NaN  11.770000  13.828462  15.317222
       5           NaN        NaN  10.660000  15.986667
       6           NaN        NaN        NaN  10.380000